[{"authorID":"UCU6LCATU","timestamp":"1544678351.319600","currentBase":"Now actually done","manualTags":[]},{"authorID":"U38LT451T","timestamp":"1544670747.258300","currentBase":"[comment] I might be able to do [12-9], tbd","manualTags":[]},{"authorID":"U38LT451T","timestamp":"1544670833.259200","currentBase":"[12-9] These parts were meant to be the same length","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544678333.319200","currentBase":"[12-11] Spent most time figuring out how to power the surgical tube (basically just the placement for the motor.) and how to attach the motor to the rest of the intake this took most of the time as we changed the design significantly after Jaden talked to Daniel. At this point the intake CAD is Done. (maybe???)","manualTags":[]},{"authorID":"U38LT451T","timestamp":"1544671284.267200","currentBase":"[12-9] (Summary) Today was our last weekend meeting before interleague! Makes me nervous, but excited. After loading everything into Daniel\u0027s garage, we set to work. The primary focus of 4042 was getting the lift working, while 12788 was hoping to get some flaws in their drive base ironed out.\n\nDaniel was the only 4042 mechanic in attendance, so he was working on the lift for most of the time. It took multiple hours to get the lift coils spooled correctly around the ratchet, mostly due to the difficulty of the task and the pancaking of important ratchet parts. During this time, I worked on developing our lift code and testing it in a very limited fashion.\n\nOnce the ratchet had been spooled correctly, Daniel went to work on intake CAD and I tested it in teleop. It seemed to function well, admittedly with some creaking and stretching from the newly installed springs. I then tried to test the lift code by lifting the robot in the air and running the lift. The first time I did, the robot made a loud bang noise, all tension in the lift vanished, and the robot hit the floor (not very hard, though). Upon inspection, I realized the lift cable had snapped. We will almost certainly be ordering paracord to replace that cabling. For now, Daniel came back to fix the lift cable. I did some basic packing up of software stuff, and then had to depart.\n\nLater, we learned our drill driver was missing. We\u0027re still unsure as to the cause, but we clearly do not own one any more. A new one has been ordered.","manualTags":[]},{"authorID":"U77PFKQQM","timestamp":"1544683239.324400","currentBase":"[12-11] today a soldered a new ultrasonic and finally got readings. I realized that the ultrasonic s error when stationary is tiny. This means that I will need to find the error when moving since the error is negligible when still. I will do this using the fact that the sensor readings should be linear so I\u0027ll preform linear regression on the readings for 100 values (or however many it takes) while the robot is running some distance. Then I will find the sum of the residuals and preform and average them to approximate \"standard deviation\" in the sensor readings. Then I\u0027ll test whether the actual filter is working lol. Lesgo!","manualTags":[]},{"authorID":"U38LT451T","timestamp":"1544670844.259600","currentBase":"[12-9] The 12788 bot, in progress","manualTags":[]},{"authorID":"U38LT451T","timestamp":"1544670869.260000","currentBase":"[12-9] Tesfa, in a moment of genius, getting a spacer stuck on a rat-tail file","manualTags":[]},{"authorID":"U6Z8TCJAU","timestamp":"1544673613.270200","currentBase":"[comment] I keep checking this channel, tabbing away once I\u0027m done reading, half remembering seeing my name (despite that it would be highlighted were it said) and having to come back and confirm you said spacer instead.","manualTags":[]},{"authorID":"U38LT451T","timestamp":"1544673040.268900","currentBase":"[comment] Congratulations :D","manualTags":[]},{"authorID":"U75P2QJH2","timestamp":"1544676779.297500","currentBase":"Lol","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544677701.310800","currentBase":"better than nothing","manualTags":[]},{"authorID":"UCPS85G87","timestamp":"1544665612.233500","currentBase":"[12-11] I spent too much time struggling with my chopped finger and lock nuts, but ended up with a functional part thing. I managed to almost finish the part - all that remains to be done is to attach a second piece of L stock and stick an axle with wheels through. ","manualTags":[]},{"authorID":"U6Z8TCJAU","timestamp":"1544673655.270900","currentBase":"[comment] I fucked up the comment formatting and put a } not a ]","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544677717.311300","currentBase":"and be careful I based most of them off of your\u0027s","manualTags":[]},{"authorID":"U38LT451T","timestamp":"1544670938.261200","currentBase":"[12-11] Votes for the 4042 robot name! The final name chosen was \"Pointless\" (yes, that\u0027s a pun), with :b: a close runner-up","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544674583.278800","currentBase":"[11-13] I finished the Proof of concept but slept late and forgot it in my rush to get to school (I live over an hour away by bus). Ill bring it Thursday for sure most of the day was again working on the CAD which is going ok still behind considering the deadline is Thursday so I don\u0027t think we\u0027ll make it. Another concern is while the CAD works I don\u0027t know how healthy it is neither me nor Adam or even Jaden have a deep understanding of Inventor so we kind of just try a lot of things and keep the ones that work so hopefully that won\u0027t be a problem later on.","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544677239.304000","currentBase":"[12-2] I was at the competition (of course) it was cool to see how much progress other teams made a little and depressing how little progress 4042 made. Completely unrelated I hope to get a laptop soon which should be able to run inventor so I can work on it at home. (my family\u0027s computer is actually not powerful enough for even the minimum requirements for Inventor.)","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544677888.315100","currentBase":"[12-7] Daniel did even more work and at this point, I don\u0027t know if he ever sleeps regardless he fixed all minor errors and addressed the main concern which was the spinning surgical tube being in the way of the sliding dustbin. Me and Jaden just added and constrained the actual tube now that it was accounted for.","manualTags":[]},{"authorID":"U7007DAE8","timestamp":"1544631201.221900","currentBase":"[12-11] Today I spent most of the day supervising the bucket shelf, or main body, of the intake while it 3-d printed. About 2 hours into the print, one of the support columns collapsed, and so I improvised and stopgap using another piece of plastic and a lot of masking tape. The improvised column fell over frequently, so I had to supervise the part to fix it when it did. Eventually a growing overhang of the part grew close enough that I could bind the column to it with masking tape, and finally at about 5:30, the printer completed the rod which rested on the support material. Thus, despite a potentially catastrophic print error, the part came out alright.","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544674952.283400","currentBase":"[11-15] I remembered the proof of concept but the adhesive I used for the surgical tube was weaker than expected so I spent I lot of time covering the whole thing in hot glue. Whenever it wasn\u0027t broken we were actually able to test it on some minerals and we concluded that we would be able to proceed as planned but also that we should fix the attachment of the tubes obviously as well as stiffer tubing to be more effective  because while it worked 45 degrees is still fairly steep in my opinion. (we could also just change the dustbin.)","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544678129.318800","currentBase":"Done","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544677678.310200","currentBase":"[12-6] Daniel redesigned the whole system and did an astonishingly good job (I don\u0027t even know to do half the stuff on what he CADed). After he presented the new plan me and Jaden agreed that it was probably much better than what we had. It did need some optimizational tweaks but we were confident we could handle those.","manualTags":[]},{"authorID":"U385QFFCN","timestamp":"1544645002.222300","currentBase":"","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544676742.297200","currentBase":"[11-29] Jaden left to assemble the lift which unsurprisingly had a negative impact on CAD progress Me and Adam worked on some boring CAD stuff after that which wasn\u0027t particularly memorable or important never the less progress continues. mostly refining stuff attaching wheels and slides as well as struggling to deal with Jaden\u0027s intake which was made in the beginning of the year and has many problems namely that it is currently impossible to manufacture as it has some infinitely small connections in it so we should probably replace that.","manualTags":[]},{"authorID":"U76J56P0E","timestamp":"1544672534.268600","currentBase":"[comment] I killed that bearing in order to get it off of the axle to put on a spacer lmao","manualTags":[]},{"authorID":"U75P2QJH2","timestamp":"1544677040.300800","currentBase":"Lol","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544676271.295500","currentBase":"[11-27] Still struggling to finish the intake (that will be a reoccurring theme) not aided by the fact that Jaden was preoccupied with driver tryouts or training or something either way it appears we have left all the most difficult stuff for last so progress was not excellent. I had to make an account on a CAD sharing website just to download the CAD for the omni wheels and then they ended up in a zipped folder with a bunch of other similarly named stuff which Adam and I had to sift through to actually get what we wanted","manualTags":[]},{"authorID":"UCPS85G87","timestamp":"1544667682.256800","currentBase":"[12-7]I continued to work on the part I started and made some solid progress. Due to one handed wishing difficulties, I have to clamp most of the tools in a vice to use them, e.g. a file, pliers, spanner, etc. Because of this,  I ended up using the vice on the milling machine, so as not to get in the way of people with more serious need for real vices. Otherwise, work progressed smoothly, but I had to detach and reattach a part at a 90 degree angle rotation.","manualTags":[]},{"authorID":"U75P2QJH2","timestamp":"1544677545.308100","currentBase":"Dude these are sad","manualTags":[]},{"authorID":"UCPS85G87","timestamp":"1544665272.227800","currentBase":"[12-4] I messed around with some ideas for improving the lift - notably reassembleing the whole thing because it was not assembled straight. However, in the interest of time, I did not try to rebuild everything, instead, I filed some areas to make them smoother and to keep them from catching during movement. For this process I used a rasp to take off material, and then a (rat something or other) file to smooth and bevel the edges.","manualTags":[]},{"authorID":"UCPS85G87","timestamp":"1544665954.238900","currentBase":"[11-30] the whole team went into frantic assembly mode. I helped put together some of the good hook be attached to the lift, but we realised it wasn\u0027t ready enough. So, we will have to try to finish during competition something. Then we packed as much as we could in preparation for competition.","manualTags":[]},{"authorID":"U75P2QJH2","timestamp":"1544626427.221200","currentBase":"[12-11] Today we had some parts of the intake 3D printed. The bucket was being printed while I was there and Gilton was supposedly working on the marker. I was working on making the intake actually work, by drilling holes in the right places so we could attach a motor to run the surgical tubing. I did this successfully, with a little bit of fixing (we now have a sort of long hole) but it is functional. Daniel came up with another ingenious idea to make an adapter to the new surgical tubing bar: to make a part that starts out square for the vex motor hole, and then use prongs to snap into holes made on the bar.","manualTags":[]},{"authorID":"UCPS85G87","timestamp":"1544667706.257100","currentBase":"[12-6] I started work on a part - Basically, when the lift is used and the robot goes up/down, the side facing the lander goes BONK. Sad faces all around and bad for electronics. To combat this, I noticed that an actobotics piece could be jammed onto a motor and from this I expanded with a thing on top and a brace on the side. Cue difficulties due to 0.95 thumb","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544676808.297900","currentBase":"dont worry its all being done on time","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544675287.286900","currentBase":"[11-16] Back to CAD today frantically working because we are past the deadline and NOT ready to build at all trying to make the intake look complete even if it\u0027s not really construction ready at the end of the day it\u0027s still not ready but at least we don\u0027t really need it for a little bit at least.","manualTags":[]},{"authorID":"U38LT451T","timestamp":"1544670960.261600","currentBase":"[12-11] I work on testing the lift code, while Gautham checks his Kalman filter code","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544677024.300500","currentBase":"[11-30] Jaden still absent from the CAD team me and Adam still attempting to make progress and generally struggling with Inventor perhaps the most productive thing I did was help with packing so that just goes to show how well the intake is going. I\u0027m growing kind of concerned considering we haven\u0027t started intake production and were already at league 2.","manualTags":[]},{"authorID":"UCPS85G87","timestamp":"1544667000.249600","currentBase":"[12-2] competition!!!! I got to be a mechanic on deck and our productivity as a team compared to other days *skyrocketed* . I worked with Daniel on a number of things, including:\nMaking a socket wrench which could fit into a tube, because normal ones did not fit. This was accomplished by hacksawing a thin piece of metal so it had a square indentation at the end, then filling out to size. Also, the tables were made of plastic, so the clamps were nearly useless. Instead, I figured we could clamp the parts in the vice, whereupon I would clamp the vice with my hands. \nWe also attached the lift string to the pulley system, and at the end, we had an untensioned lift! Sadly it wasn\u0027t used in the matches. We also attached the hook, using copious amounts of duct tape and a hammer. We also needed to shorten a section which could not be hacksawed, so, we cold chiseled it! Afterwards there was a mock judging session which I went to.","manualTags":[]},{"authorID":"U38LT451T","timestamp":"1544670824.258800","currentBase":"[12-9] Daniel works on assembling and fixing the lift, while Alex considers spacers for the 12788 bot","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544674286.273700","currentBase":"[11-9] Mostly a work day for CAD as well as some planning on the proof of concept for the whole surgical tube spinner thing I think I know how I want to build it but we\u0027ll see. The CAD seems to be falling a bit behind (maybe because the whole robot is a bit behind) so we\u0027ll just have to see how it goes.","manualTags":[]},{"authorID":"U38LT451T","timestamp":"1544670688.257900","currentBase":"[comment] I might not have time to write up documentation for [12-7] or [12-11], but I hear the notebook is being finalized soon so here\u0027s some photos at least","manualTags":[]},{"authorID":"U38LT451T","timestamp":"1544670882.260400","currentBase":"[12-9] Angelina files a spacer for the 12788 robot","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544677467.306900","currentBase":"[12-4] Daniel started to help save the intake and wow there are a lot of problems the only hope now is to 3D print but if we can do that we might have like a 5% chance of being ready for the competition which is actually an improvement. For real though this might actually work.","manualTags":[]},{"authorID":"U75P2QJH2","timestamp":"1544677818.313700","currentBase":"Uh... those are nothing like my amazing documentation :)","manualTags":[]},{"authorID":"UCU6LCATU","timestamp":"1544675589.291100","currentBase":"[11-20] More work on CAD to me it seems as we get closer and closer the progress gets slower and slower which could of a product of all the bad CAD we made early on when we didn\u0027t really know how to CAD catching up to us (not that we experts now). either way Jaden finally changed the dustbin so it\u0027s not 16in which meant me and Adam had to adjust a bunch of other stuff to fit.","manualTags":[]},{"authorID":"U38LT451T","timestamp":"1544670893.260800","currentBase":"[12-9] 12788 breaking a bearing (how? nobody knows)","manualTags":[]},{"authorID":"U38LT451T","timestamp":"1544670782.258400","currentBase":"[12-9] Daniel works on retentioning the lift after the string acts up (again)","manualTags":[]}]